In [1]:
import pandas as pd

In [7]:
df = pd.DataFrame(columns=["Name","Age","Height"])

In [4]:
display(df)

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [41]:
df.loc[0] = ("Allen",22,175)
df.loc[1] = ("Ted",25,180)
df.loc[2] = ("Jack",28,177)
df.loc[3] = ("Tim",33,170)
df

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180
3    Tim   33     170
2   Jack   28     177

In [17]:
df["Age"]

0    22
1    25
2    28
3    33
Name: Age, dtype: int64

In [33]:
df["Weight"] = [75,80,85,65]
df

    Name  Age  Height  Weight
0  Allen   22     175      75
1    Ted   25     180      80
2   Jack   28     177      85
3    Tim   33     170      65

In [34]:
df = df.drop(["Weight"],axis = 1)

In [42]:
df = df.drop(3,axis = 0)

In [43]:
df

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   28     177

In [49]:
df.loc[2,"Height"] = 175
df

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   28     175

In [56]:
df.loc[2,"Height"] = 177
df = df.drop("Jack",axis = 0)

In [57]:
c = ["Name","Age","Height"]
d = [
    ["Jake",26,180],
    ["Trump",23,185],
]

df2 = pd.DataFrame(
    data = d ,
    columns = c ,
)

df2

    Name  Age  Height
0   Jake   26     180
1  Trump   23     185

In [65]:
df_union = pd.concat(
    [df,df2],axis = 0
).reset_index(drop = True)

df_union

    Name   Age  Height
0  Allen  22.0   175.0
1    Ted  25.0   180.0
2   Jack  28.0   177.0
3   Jake  26.0   180.0
4  Trump  23.0   185.0

In [66]:
df_union.to_csv("basic.csv")
df_union

    Name   Age  Height
0  Allen  22.0   175.0
1    Ted  25.0   180.0
2   Jack  28.0   177.0
3   Jake  26.0   180.0
4  Trump  23.0   185.0